InformationRegisters/Остатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>Остатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачОст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рсх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолНаДату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолИнв</Name>
					<Comment>количество считанное другими планшетами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПредОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Место</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Забаланс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СинхроДвж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СинхроДвж</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнфоПослДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НоменклатураДляПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>НоменклатураДляПечати</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Остатки/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Склад = глДоступ.ПолучитьОсновнойСклад();

	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ DISTINCT
	               |	Остатки.Склад КАК Склад
	               |ИЗ
	               |	РегистрСведений.Остатки КАК Остатки
				   |
				   |WHERE Склад <> Значение(Справочник.Склады.ПустаяСсылка)
				   |";
	Тбл = Запрос.Выполнить().Выгрузить();
	Если ТБл.Количество()<>0 Тогда
		Если ЗначениеЗаполнено(Склад)=Ложь Тогда
			Склад = тбл[0].Склад;
		КонецЕСЛИ;
		Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(тбл.ВыгрузитьКолонку("Склад")); 
	КонецеСЛИ;
	
	СкладПриИзмененииНасервере();	
	
КонецПроцедуры


&НаСервере
Процедура УстФильтрСклад()
	эл = Список.Параметры.Элементы.Найти("Склад");
	Эл.Значение = Склад;
	Эл.Использование = Истина;
	
	эл = Список.Параметры.Элементы.Найти("ДатаСинхронизации");
	Эл.Значение = ДатаСинхронизации;
	Эл.Использование = Истина;
	
	эл = Список.Параметры.Элементы.Найти("Дата");
	Эл.Значение = ДатаЗакрытияДвж;
	Эл.Использование = Истина;
	
	эл = Список.Параметры.Элементы.Найти("ПоМЕстам");
	Эл.Значение = ПоМЕстам;
	Эл.Использование = Истина;
	
	
	эл = Список.Параметры.Элементы.Найти("Забаланс");
	Эл.Значение = Забаланс;
	Эл.Использование = Истина;
	
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНасервере()
	Стк = РегистрыСведений.СинхроДвж.ПоследняяВыгрузкаНаСервер(Склад);
	ДатаЗакрытияДвж = Стк.Дата;
	ДатаСинхронизации = Стк.ДатаСинхронизации;
	ЭтаФорма.Заголовок = "Остатки";
	УстФильтрСклад();	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	УстФильтрСклад()
КонецПроцедуры


//=============================
#Область ПечатьЭтикеток

&НаКлиенте
Процедура ПечатьВсехЭтикеток(Команда)
	ПечатьЭтикетки();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикетки(УказатьАдресПрнтера=Ложь) экспорт
	
	Если ЗначениеЗаполнено(Склад) = Ложь ТОгда
		Сообщить("не выбран Склад!");
		Возврат;
	КонецеСЛИ;
	
	оо = Новый ОписаниеОповещения("оо_ответНаВопрос",ЭтотОбъект);
	ПоказатьВопрос(оо,"Распечатать этикетки для всей номенклатуры?",РежимДиалогаВопрос.ДаНет);
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВводаСтроки(Стр,ДопПар) Экспорт
	
	Если Стр = Неопределено Тогда ВозвраТ; КонецЕСЛИ;
	глОбщий.АдресПринтера(Стр);	
	ПечатьЭтикетки(ДопПар);
	
КонецПроцедуры

&НаКлиенте
Процедура  оо_ответНаВопрос(Рез,Параметры) Экспорт
	Если Рез = Неопределено ТОгда Возврат; КонецЕСЛИ;
	Если Рез <> КодВозвратаДиалога.Да Тогда Возврат; КонецеСЛИ;
	
	мас = ПолучитьМасНом();
	
	
	
	Для каждого Эл из Мас Цикл
		глОбщийКлиент.ПечатьЭтикетки(Эл);
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПолучитьЗначениеОтбора(ЭлементыОтбора, ПолеКомпоновкиДанных, Результат)
    
    Для каждого ЭлементОтбора Из ЭлементыОтбора Цикл
    
        Если ТипЗнч(ЭлементОтбора) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда
            
            ПолучитьЗначениеОтбора(ЭлементОтбора.Элементы, ПолеКомпоновкиДанных, Результат)
            
        Иначе
            
            Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиДанных Тогда
                Результат = ЭлементОтбора.ПравоеЗначение;
                Прервать;
            КонецЕсли;
            
        КонецЕсли;
        
        Если ЗначениеЗаполнено(Результат) Тогда
            Прервать;
        КонецЕсли;
        
    КонецЦикла; 
    
КонецПроцедуры

&НаСервере
Функция ПолучитьМасНом() 
	Запрос = новый Запрос;
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Наименование","%");
	
	ПолеКомпоновкиДанных = Новый ПолеКомпоновкиДанных("Номенклатура.Наименование");
	ЭлементыОтбора = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных().Отбор.Элементы;
	
	Результат = "";
	ПолучитьЗначениеОтбора(ЭлементыОтбора, ПолеКомпоновкиДанных, Результат);
	Если Результат<>"" Тогда
		Запрос.УстановитьПараметр("Наименование","%"+Результат+"%");
	КонецеСЛИ;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Остатки.Номенклатура КАК Номенклатура
	               |ИЗ
	               |	РегистрСведений.Остатки КАК Остатки
	               |ГДЕ
	               |	Остатки.Склад = &Склад  и Остатки.Забаланс = Ложь
	               |	И Остатки.Номенклатура.Наименование ПОДОБНО &Наименование";
	
	
	ТБл = Запрос.Выполнить().Выгрузить();
	//Сообщить(Тбл.Количество());
	
	Возврат Тбл.ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

&НаКлиенте
Процедура ПечатьЭтикетки1(Команда)
	Если ТипЗнч(Элементы.Список.ТекущиеДанные.Номенклатура)<>Тип("СправочникСсылка.Номенклатура") ТОгда Возврат; КонецЕСЛИ;
	
	Для каждого эл из Элементы.Список.ВыделенныеСтроки Цикл
		Элементы.Список.ТекущаяСтрока = эл;
		глОбщийКлиент.ПечатьЭтикетки(Элементы.Список.ТекущиеДанные.Номенклатура,ложь,1);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДвижениеНаСервере(Склад,Ном)
	
	текОрг = Склад.Организация;	
	
	СткСоединение = глОбщий.СткПолучитьСоединение(текОрг);
	Соединение = Новый HTTPСоединение(
	СткСоединение.Сервер, // сервер (хост)
	СткСоединение.Порт, // порт, по умолчанию для http используется 80, для https 443
	СткСоединение.Логин, // пользователь для доступа к серверу (если он есть)
	СткСоединение.Пароль, // пароль для доступа к серверу (если он есть)
	, // здесь указывается прокси, если он есть
	, // таймаут в секундах, 0 или пусто - не устанавливать
	// защищенное соединение, если используется https
	);
	
	
	сткПар = новый Структура("идСкл,идНом",СокрлП(Склад.УникальныйИдентификатор()),СокрлП(Ном.УникальныйИдентификатор()));
	хр = Новый ХранилищеЗначения(сткПар, Новый СжатиеДанных(3));
	
	
	стрАПИ = "/"+текОрг.APIrest+"/hs/invAPI/DVGTMC";
	Запрос = Новый HTTPЗапрос(стрАПИ);
	Запрос.УстановитьТелоИзСтроки(XMLСтрока(хр));
	
	
	Результат = Соединение.ОтправитьДляОбработки(Запрос);
	Если Результат.КодСостояния <> 200 Тогда 
		Сообщить(результат.ПолучитьТелоКакСтроку());
		Сообщить("Ошибка печати этикетки: код "+Результат.КодСостояния);
		Возврат Неопределено;
	КонецЕСЛИ;
	
	
	Таб = XMLзначение(Тип("ХранилищеЗначения"),результат.ПолучитьТелоКакСтроку()).Получить();
	Если ТипЗнч(Таб) <> Тип("ТабличныйДокумент") ТОгда
		Сообщить("Неверный тип при ответе");
		Возврат Неопределено;
	КонецЕСлИ;
	
	//Таб = Новый ТабличныйДокумент;
	Таб.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	
	Возврат Таб;
	
	
	
КонецФункции

&НаКлиенте
Процедура Движение(Команда)
	
	Таб = ДвижениеНаСервере(Склад,Элементы.список.ТекущиеДанные.Номенклатура);
	
	
	Если Таб<>Неопределено Тогда
		ИмяФайла = ПолучитьИмяВременногоФайла("pdf");
		Таб.Записать(ИмяФайла,ТипФайлаТабличногоДокумента.PDF);
		ЗапуститьПриложение(ИмяФайла);	
	КонецеСЛИ;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистр(Команда)
	ОткрытьФорму("РегистрСведений.Остатки.Форма.ФормаСписка2",,ЭтаФорма,ЭтаФорма);
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Процедура ДобавитьДляПечатиНаСервере(ссНом)
	Зап = РегистрыСведений.НоменклатураДляПечати.СоздатьМенеджерЗаписи();
	Зап.Номенклатура = ссНом;
	Зап.Записать();
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьДляПечати(Команда)
	
	Если ТипЗнч(Элементы.Список.ТекущиеДанные.Номенклатура)<>Тип("СправочникСсылка.Номенклатура") ТОгда Возврат; КонецЕСЛИ;
	
	Для каждого эл из Элементы.Список.ВыделенныеСтроки Цикл
		Элементы.Список.ТекущаяСтрока = эл;
		ДобавитьДляПечатиНаСервере(Элементы.Список.ТекущиеДанные.Номенклатура);
	КонецЦикла;
	
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПечатиЭтикеток(Команда)
	ОткрытьФорму("РегистрСведений.НоменклатураДляПечати.ФормаСписка",,ЭтаФорма);
КонецПроцедуры
